In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from pandas import Series,DataFrame

# Selecting Enteries

In [4]:
a=Series([1,2,3],index=['a','b','c'])

In [5]:
a

a    1
b    2
c    3
dtype: int64

In [6]:
a1=a*2

In [7]:
a1

a    2
b    4
c    6
dtype: int64

In [8]:
a2=a*8

In [9]:
a2

a     8
b    16
c    24
dtype: int64

# Grab by index

In [10]:
a1[1]                           #w.r.t. position

4

In [11]:
a['b']                          #w.r.t. index

2

In [12]:
a1['b']

4

In [13]:
a1['a':'b']

a    2
b    4
dtype: int64

In [14]:
a1[0:2]

a    2
b    4
dtype: int64

In [15]:
a1[['a','c']]

a    2
c    6
dtype: int64

In [16]:
a1

a    2
b    4
c    6
dtype: int64

In [17]:
a1 > 3

a    False
b     True
c     True
dtype: bool

In [18]:
a1[a1>3]

b    4
c    6
dtype: int64

In [19]:
a1[a1>3]=10

In [20]:
a1

a     2
b    10
c    10
dtype: int64

In [4]:
b=DataFrame(np.arange(25).reshape(5,5),index=['kkr','csk','mi','rcb','dd'],columns=['a','b','c','d','e'])

In [5]:
b

      a   b   c   d   e
kkr   0   1   2   3   4
csk   5   6   7   8   9
mi   10  11  12  13  14
rcb  15  16  17  18  19
dd   20  21  22  23  24

In [23]:
b['b']

kkr     1
csk     6
mi     11
rcb    16
dd     21
Name: b, dtype: int64

In [24]:
b[['b','c']]

      b   c
kkr   1   2
csk   6   7
mi   11  12
rcb  16  17
dd   21  22

In [6]:
b[['b':'c']]

SyntaxError: invalid syntax (2565984114.py, line 1)

In [26]:
b

      a   b   c   d   e
kkr   0   1   2   3   4
csk   5   6   7   8   9
mi   10  11  12  13  14
rcb  15  16  17  18  19
dd   20  21  22  23  24

In [27]:
b[b>8]

        a     b     c     d     e
kkr   NaN   NaN   NaN   NaN   NaN
csk   NaN   NaN   NaN   NaN   9.0
mi   10.0  11.0  12.0  13.0  14.0
rcb  15.0  16.0  17.0  18.0  19.0
dd   20.0  21.0  22.0  23.0  24.0

In [31]:
b>8

         a      b      c      d      e
kkr  False  False  False  False  False
csk  False  False  False  False   True
mi    True   True   True   True   True
rcb   True   True   True   True   True
dd    True   True   True   True   True

In [32]:
b

      a   b   c   d   e
kkr   0   1   2   3   4
csk   5   6   7   8   9
mi   10  11  12  13  14
rcb  15  16  17  18  19
dd   20  21  22  23  24

In [29]:
b[b['c']>8]

      a   b   c   d   e
mi   10  11  12  13  14
rcb  15  16  17  18  19
dd   20  21  22  23  24

In [33]:
b[b['b']>10]

      a   b   c   d   e
mi   10  11  12  13  14
rcb  15  16  17  18  19
dd   20  21  22  23  24

In [34]:
b['c']>8

kkr    False
csk    False
mi      True
rcb     True
dd      True
Name: c, dtype: bool

In [35]:
[b['c']>8]

[kkr    False
 csk    False
 mi      True
 rcb     True
 dd      True
 Name: c, dtype: bool]

In [36]:
b['a']<5

kkr     True
csk    False
mi     False
rcb    False
dd     False
Name: a, dtype: bool

In [37]:
b[b['a']<5]

     a  b  c  d  e
kkr  0  1  2  3  4

In [39]:
b.loc['kkr']

a    0
b    1
c    2
d    3
e    4
Name: kkr, dtype: int64

In [40]:
b.iloc[0]

a    0
b    1
c    2
d    3
e    4
Name: kkr, dtype: int64

In [41]:
b.iloc[0:1]

     a  b  c  d  e
kkr  0  1  2  3  4

In [42]:
b.loc['mi']

a    10
b    11
c    12
d    13
e    14
Name: mi, dtype: int64

# Data Alignment

In [43]:
a=Series([1,2,3],index=['a','b','c'])

In [44]:
b=Series([3,4,5,6],index=['a','b','c','d'])

In [45]:
a

a    1
b    2
c    3
dtype: int64

In [46]:
b

a    3
b    4
c    5
d    6
dtype: int64

In [60]:
a+b

a    4.0
b    6.0
c    8.0
d    NaN
dtype: float64

In [61]:
b.add(a,fill_value=0)

a    4.0
b    6.0
c    8.0
d    6.0
dtype: float64

In [49]:
c=DataFrame(index=[0,1,2],columns=['Name','Age','Height','Percent'])

In [50]:
c

  Name  Age Height Percent
0  NaN  NaN    NaN     NaN
1  NaN  NaN    NaN     NaN
2  NaN  NaN    NaN     NaN

In [51]:
#abc,xyz,pqr

In [52]:
#37,19,32

In [53]:
#5.8,5.10,5.7

In [54]:
#62,86,54

In [58]:
Name=Series(['abc','xyz','pqr'],index=[0,1,2])

In [64]:
Age=Series([37,19,32],index=[0,1,2])

In [65]:
Height=Series([5.8,5.10,5.7],index=[0,1,2])

In [66]:
Percent=Series([62,86,54],index=[0,1,2])

In [69]:
c['Name']=Name

In [70]:
c['Age']=Age

In [71]:
c['Height']=Height

In [73]:
c['Percent']=Percent

In [74]:
c

  Name  Age  Height  Percent
0  abc   37     5.8       62
1  xyz   19     5.1       86
2  pqr   32     5.7       54

In [4]:
y=DataFrame(np.arange(9).reshape(3,3),index=['mi','csk','kkr'],columns=['A','C','D'])

In [5]:
y

     A  C  D
mi   0  1  2
csk  3  4  5
kkr  6  7  8

In [6]:
x=DataFrame(np.arange(4).reshape(2,2),index=['mi','csk'],columns=['A','B'])

In [7]:
x

     A  B
mi   0  1
csk  2  3

In [8]:
x

     A  B
mi   0  1
csk  2  3

In [21]:
x+y

       A   B   C   D
csk  5.0 NaN NaN NaN
kkr  NaN NaN NaN NaN
mi   0.0 NaN NaN NaN

In [29]:
pd.isnull(x+y)                 #........Day12

         A     B     C     D
csk  False  True  True  True
kkr   True  True  True  True
mi   False  True  True  True

In [30]:
x+y.dropna()                   #.........Day12

       A   B   C   D
csk  5.0 NaN NaN NaN
kkr  NaN NaN NaN NaN
mi   0.0 NaN NaN NaN

In [10]:
A=y.add(x,fill_value=0)

In [11]:
A

       A    B    C    D
csk  5.0  3.0  4.0  5.0
kkr  6.0  NaN  7.0  8.0
mi   0.0  1.0  1.0  2.0

In [12]:
B=y.add(x,fill_value=2)

In [13]:
B

       A    B    C     D
csk  5.0  5.0  6.0   7.0
kkr  8.0  NaN  9.0  10.0
mi   0.0  3.0  3.0   4.0

In [20]:
x,y

(     A  B
 mi   0  1
 csk  2  3,
      A  C  D
 mi   0  1  2
 csk  3  4  5
 kkr  6  7  8)